# Задание 4
#
# Напишите программу, которая считает количество букв “о”
# в введенном пользователем слове.


user = input('введи слово?')
count = user.count('о')
print(f'всего букв о: {count}')