MORSE_CODE = {
    '.-': 'A', '-...': 'B', '-.-.': 'C', '-..': 'D', '.': 'E', '..-.': 'F',
    '--.': 'G', '....': 'H', '..': 'I', '.---': 'J', '-.-': 'K', '.-..': 'L',
    '--': 'M', '-.': 'N', '---': 'O', '.--.': 'P', '--.-': 'Q', '.-.': 'R',
    '...': 'S', '-': 'T', '..-': 'U', '...-': 'V', '.--': 'W', '-..-': 'X',
    '-.--': 'Y', '--..': 'Z', '.----': '1', '..---': '2', '...--': '3',
    '....-': '4', '.....': '5', '-....': '6', '--...': '7', '---..': '8',
    '----.': '9', '-----': '0', '/': ' '
}


morse_message = ".... . .-.. .-.. --- / .-- --- .-. .-.. -.."

morse_message = morse_message.split(' ')
print(morse_message)

res = []
for letter in morse_message:
    print('Элемент списка', letter)
    l = MORSE_CODE[letter]
    print('Значение l', l)
    res.append(l)
    print('Значение cсписка', res)

res = "".join(res)
print(res)