

a = [32, 43, 12, 34]

1.все элементы списка имеют адрес
   с 0 до ...
2. цикл позволяет перебирать все числа 
  с 0 до ...

Следовтельно, используя циклы, мы 
можем перебрать все элементы списка

вместо ручного перебора
a[0] = 32
a[1] = 43
a[2] = 12
a[3] = 34

используем цикл 

for i in range(4 или len(a)):
    print(a[i])

32
43
12
34



numbers = [43, 5, -1, 4, 12]

1. Создать перменную с минимальным значением по умолчанию.
 Это будет первый элемент
2. Начать перебирать все элементы
3. Если встречаем элемент меньше выбранного в начале - то 
делаем его минимальным 
4. выводим итоговое минимальное значение из переменной

########3##

1. Создать переменные для хранения будущих значений. Они равны 0.
  -- сумма отрицательных
  -- сумма четных 
 -- ..
2. Перебираем все элементы из списка
3. Вставляем необходимые условия  
     - если число отрицательное
	- прибавить его к переменной из 1 этапа
     - если .....
4. Вывести значения всех переменных в f string

"Сумма отрицательных: -8"
.... 


Чтобы сгенерировать свой список 

1. Имопртируем рандом
2. Создать пустой список для наполнения 
3. В цикле надо генерировать число и добавлять его в созданный список 
4. Вывести список на экран 



Напишите программу для формирования базы знаний для игры викторину. Программа должна спрашивать у пользователя 3  вопроса и 3 ответа. Вопросы и ответы нужно добавлять в отдельные списки. Результатом программы являются два списка. 

1. Создаем пустые списки для вопросов и ответов 
2. Запускаем цикл для трех итераций
3. В каждой итерации:
	- Спросить у пользователя вопрос 
	- Добавить его в список с вопросами
	- Спросить у пользователя ответ
	- Добавить в список с ответами
4. Вывести списки на экран 



Напишите программу для подсчета слов в предложении. Пользователь вводит какое-то предложение. В ответ программа должна вывести количество слов. 

Сидим на паре решаем задачи



Дана строка c помехами. Вместо пробелов стоит цифра “1”. Замените ее на символ пробела. Результатом программы является строка с пробелами.   

text = “В1центре1Галактики1находится1сверхмассивная1чёрная1дыра” 

* списки, метод split(), метод join()

1. Используя split получить список слов
2. Использця join получить предложение 



Дан текст. Необходимо заменить на символ “*” все слова, которые есть в списке секретных слов. 

text = “Для того чтобы изучить программирование нужно всего лишь изучать его и все ”

secret = ['программирование', 'изучать', 'его']


1. Переводим строку в список 
2. Запускаем цикл, перебираем в нем все слова 
3. Если встречаем слово из списка секретных то меняем значение элемента 
    text[3] = '*'
4. Применить метод join для измененного списка
5. Вывести строку на экран 



В двух списках находится информация о количестве населения в разных странах. Найдите страну с самым большим и с самым маленьким населением. 

countries = ['Италия', 'Индия', 'Россия', 'США', 'Китай', 'Нидерланды']
people = [58966453, 1434998000, 146150789, 341169410, 1409670000, 17967505]

* списки

1. Ищем минимальное число в списке people 
2. Находим индекс этого числа в списке 
3. И теперь в списке countries берем элемент по этому индексу 
4. Выводим страну и население


























